# web - production
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `failure`
<details><summary>Show Plan</summary>
```terraform

module.common_resources.data.vercel_project_directory.default: Reading...
module.common_resources.data.vercel_project_directory.default: Read complete after 0s [id=../../../]
module.common_resources.data.aws_ssm_parameter.user_pool_id: Reading...
module.common_resources.data.aws_ssm_parameter.organization_api_endpoint: Reading...
module.common_resources.data.aws_ssm_parameter.customer_api_endpoint: Reading...
module.common_resources.data.aws_ssm_parameter.identity_api_endpoint: Reading...
module.common_resources.data.aws_ssm_parameter.gateway_api_endpoint: Reading...
module.common_resources.data.aws_ssm_parameter.user_pool_id: Read complete after 0s [id=user_pool_id]
module.common_resources.data.aws_ssm_parameter.customer_api_endpoint: Read complete after 0s [id=customer_api_endpoint]
module.common_resources.data.aws_ssm_parameter.identity_api_endpoint: Read complete after 0s [id=identity_api_endpoint]
module.common_resources.data.aws_ssm_parameter.organization_api_endpoint: Read complete after 0s [id=organization_api_endpoint]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # module.common_resources.aws_cognito_user_pool_client.default will be created
  + resource "aws_cognito_user_pool_client" "default" {
      + access_token_validity                         = (known after apply)
      + allowed_oauth_flows                           = [
          + "code",
        ]
      + allowed_oauth_flows_user_pool_client          = true
      + allowed_oauth_scopes                          = [
          + "email",
          + "openid",
          + "profile",
        ]
      + auth_session_validity                         = (known after apply)
      + callback_urls                                 = [
          + "http://localhost:3000/api/auth/callback/cognito",
          + "https://new-production.connectilly.com/api/auth/callback/cognito",
        ]
      + client_secret                                 = (sensitive value)
      + default_redirect_uri                          = (known after apply)
      + enable_propagate_additional_user_context_data = (known after apply)
      + enable_token_revocation                       = true
      + explicit_auth_flows                           = [
          + "ALLOW_REFRESH_TOKEN_AUTH",
          + "ALLOW_USER_SRP_AUTH",
        ]
      + generate_secret                               = true
      + id                                            = (known after apply)
      + id_token_validity                             = (known after apply)
      + logout_urls                                   = (known after apply)
      + name                                          = "production_web"
      + prevent_user_existence_errors                 = "ENABLED"
      + read_attributes                               = (known after apply)
      + refresh_token_validity                        = (known after apply)
      + supported_identity_providers                  = [
          + "COGNITO",
          + "Google",
        ]
      + user_pool_id                                  = (sensitive value)
      + write_attributes                              = (known after apply)
    }

  # module.common_resources.random_password.nextauthsecret will be created
  + resource "random_password" "nextauthsecret" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 256
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "!#$%&*()-_=+[]{}<>:?"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

Plan: 2 to add, 0 to change, 0 to destroy.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*